{
    "date": "2023-11-02 23:54:35",
    "jobs": [
        {
            "posted_at": "30+ days ago",
            "applications": null,
            "title": "Data Analyst",
            "company_name": "Clario",
            "company_rating": "3.8",
            "company_reviews": "5",
            "location": "Remote",
            "location_type": null,
            "apply_link": "https://www.indeed.com/applystart?jk=e90a1cb0b8b2d848&from=vj&pos=bottom&mvj=0&jobsearchTk=1he93rqf2k7st800&spon=0&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXjOKe48WsaQxjL6gvMz7gyyl8EZNoFLzyHkpvcd7-Y9bg&vjfrom=vjs&astse=237bf01ad3c89d07&assa=4853",
            "pay": null,
            "job_type": null,
            "benefits": null,
            "description": "Data analyst responsibilities include conducting full lifecycle analysis to include requirements, activities, and design. Data analyst will develop analysis and reporting capabilities. Turn data into information, information into insight and insight into business decisions.\nESSENTIAL DUTIES AND RESPONSIBILITIES:\nUsing statistical tools to identify, analyze, and interpret patterns and trends in complex data sets could be helpful for the diagnosis and prediction.\nAssigning numerical value to essential business functions so that business performance can be assessed and compared over periods of time.\nAnalyzing local, national, and global trends that impact both the organization and the industry.\nPreparing reports for the management stating trends, patterns, and predictions using relevant data\nPreparing final analysis reports for the stakeholders to understand the data-analysis steps, enabling them to take important decisions based on various facts and trends.\nIn this role, you will combine business understanding, data handling, and data visualization to drive smarter, more data-driven business decisions.\nAcquire data from primary or secondary data sources and maintain databases/data systems.\nIdentify, analyze, and interpret trends or patterns in complex data sets.\nAnalyze internal trends and translate data into consumable insights for varying audiences.\nCommunicate the results of analysis with business partners to impact strategy and action.\nEnsure data integrity and accuracy through focus and attention to detail.\nQualifications:\nExperience:\nProven working experience as a Data Analyst or Business Data Analyst.\nTechnical expertise regarding data models, database design development, data mining and segmentation techniques.\nStrong knowledge of and experience with reporting packages (Business Objects etc.), databases (SQL etc.), programming (XML, JavaScript, or ETL frameworks).\nKnowledge of statistics and experience using statistical packages for analyzing datasets (Excel, SPSS, SAS etc.).\nStrong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy.\nAdept at queries, report writing and presenting findings.\nEducation:\nBS in Mathematics, Economics, Computer Science, Information Management or Statistics.\nEEO Statement\nClario is an equal opportunity employer. Clario evaluates qualified applicants without regard to race, color, religion, gender, national origin, age, sexual orientation, gender identity or expression, protected veteran status, disability/handicap status, or any other legally protected characteristic.\nThe Department Head has the discretion to hire personnel with a combination of experience and education, which may vary from the above listed qualifications.\nThe duties and responsibilities listed in this job description represent the major responsibilities of the position. Other duties and responsibilities may be assigned, as required. Clario reserves the right to amend or change this job description to meet the needs of Clario. This job description and any attachments do not constitute or represent a contract.\nCourageously Curious\n\nOur appetite to blend the best of domain expertise, technology and human understanding knows no bounds. We’re relentless in pursuing the information, insights and inspiration that means we can continuously improve clinical trial site support services and technology solutions.\n\nBehaviors:\n\nWe learn; embracing change, questioning how we work, finding a better way. And if it doesn't go to plan, we don't blame each other; instead, we own it and grow together\nWe partner' with each other, with customers, patients and sites, working with them to understand their goals and then deliver the best solutions, Deliver Exceptional\n\nWe step forward because responsibility powers us; we don’t leave others to do what we can do ourselves. We take charge of events, delivering exceptional work for our customers, patients and each other.\n\nBehaviors:\n\nWe prioritize; focusing on what matters, never compromising on quality.\nWe commit; delivering what we say we will, working with energy and intent, sharing what we learn with each other., People first, always\n\nWe think of others before we think of ourselves. We have a deep understanding of our customers, and deep empathy for patients—and each other. We’re united by our purpose—it’s why we go above and beyond to support each other, emphatically.\n\nBehaviors:\n\nWe do the right thing; for our customers, patients, sites and each other. And We're passionate about it.\nWe lift each other up; respectful of different views, we listen are inclusive, and support each other to succeed."
        },
        {
            "posted_at": "Today",
            "applications": null,
            "title": "Data Scientist",
            "company_name": "Splunk",
            "company_rating": "4.1",
            "company_reviews": "84",
            "location": "Durham, NC",
            "location_type": null,
            "apply_link": "https://www.indeed.com/applystart?jk=e50ffbafa5ee8509&from=vj&pos=bottom&mvj=0&jobsearchTk=1he93rqf2k7st800&spon=0&xfps=9b5978ae-d914-46cc-afb4-58a0d2fbc36b&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXgJj-0ZpAbmwMu8i_bJJN7ZnUUKYs5yKqp3Fg7KgmoxhA&vjfrom=vjs&astse=1a65f19a6e779788&assa=1068",
            "pay": "$104,000 - $143,000 a year",
            "job_type": null,
            "benefits": [
                "401(k)",
                "401(k) matching",
                "Dental insurance",
                "Health insurance",
                "Paid time off",
                "Vision insurance"
            ],
            "description": "Join Splunk as we pursue our vision to make companies more resilient through access to all machine data. At Splunk, we’re committed to our work, customers, having fun and most importantly–to success. Learn more about Splunk careers and how you can become a part of our journey!\nRole\nSplunk is rapidly expanding their presence in the cloud, while optimizing to improve profitability. To do so, we have adopted the FinOps model of monitoring and reporting on cloud usage, and providing guidance for optimization of cloud resources. We are looking for professionals who are interested in growing the FinOps practice and tooling at Splunk, with impact across our entire Splunk Cloud suite of products. Join us for a great opportunity to both lead and to learn. This role will require someone who is local to the Raleigh/Durham, NC Area.\nIn this role, you will contribute at an individual level and will use your solid understanding of the FinOps principles and domains, to implement Data Science at Splunk. As a Data Scientist, you will enhance our data capabilities, and will have opportunities to drive initiatives within the organization. You will work independently with limited guidance, and will have the opportunity to demonstrate multiple contributions each year across all domains. This is a position with broad impact–what you build will be used across all of Splunk Cloud. You need to be able to build robust solutions that are easy to use and provide exponential impact to an organization.\nRequired Skills\nExperience working in a data science environment, with examples of tooling/analysis provided to impact cloud spend.\nExperience working with at least 1 cloud service provider: AWS, Azure, GCP. Familiarity with billing constructs and basic services. Certification in one of the providers is a plus.\nAble to independently own FinOps engagements with external teams and drive to a measurable outcome.\nExperience consulting for external teams, with examples of how you have identified where challenges lie and suggested common solutions.\nAble to speak fluently about the 6 FinOps Domains, and associated capabilities.\nExperience implementing or monitoring KPIs for improvement of capabilities.\nExperience collaborating across the multiple data science personas, particularly Engineering, Product Management and Finance teams.\nAbility to provide drafts of communications for the executive personas.\nProgramming Requirements\nRequires 3-5 years of related work experience with a Bachelor’s degree or equivalent practical experience; or 2-3 years and a technical Master’s degree or equivalent practical experience\n3-5 years programming experience, with proficiency in any of the following programming languages: Python, GoLang, Java, C.\nWhat We Provide\nOpportunities to develop and grow as business analyst/engineer. We are a large company, and what you help to build will be relied on for monitoring/reporting against multiple products and will be used by hundreds of engineers. You will be able to materially impact the operating margins of Splunk through your efforts, gaining skills that will remain marketable as you grow and more companies around the world move workloads into the cloud. You will be working with talented and dedicated peers, with ample opportunities to both mentor and be mentored. We believe in growing our people through ownership and leadership opportunities.\nAt Splunk, we recognize that different backgrounds in our teams lead to better business outcomes. At Splunk we provide a number of Employee Resources for employees of all backgrounds (please ask to learn more). All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which the candidate is applying.\nNote:\nBase Pay Range\nSF Bay Area, Seattle Metro, and New York City Metro Area\nBase Pay Range: $125,600.00 - 172,700.00 per year\nCalifornia (excludes SF Bay Area), Washington (excludes Seattle Metro), Washington DC Metro, and Massachusetts\nBase Pay Range: $112,000.00 - 154,000.00 per year\nAll other cities and states excluding California, Washington, Massachusetts, New York City Metro Area and Washington DC Metro Area.\nBase Pay Range: $104,000.00 - 143,000.00 per year\nSplunk provides flexibility and choice in the working arrangement for most roles, including remote and/or in-office roles. We have a market-based pay structure which varies by location. Please note that the base pay range is a guideline and for candidates who receive an offer, the base pay will vary based on factors such as work location as set out above, as well as the knowledge, skills and experience of the candidate. In addition to base pay, this role is eligible for incentive compensation and may be eligible for equity or long-term cash awards.\nBenefits are an important part of Splunk's Total Rewards package. This role is eligible for a competitive benefits package which includes medical, dental, vision, a 401(k) plan and match, paid time off and much more! Learn more about our comprehensive benefits and wellbeing offering at https://splunkbenefits.com."
        },
        {
            "posted_at": "30+ days ago",
            "applications": null,
            "title": "College Graduate - Data Science (BS/MS)",
            "company_name": "INTEL",
            "company_rating": "4.1",
            "company_reviews": "6,154",
            "location": "Santa Clara, CA",
            "location_type": null,
            "apply_link": "https://www.indeed.com/applystart?jk=3c21a0e654ace006&from=vj&pos=bottom&mvj=0&jobsearchTk=1he93rqf2k7st800&spon=0&xfps=00e83e8c-ebc3-4fec-81b5-8f6d5b67a799&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXhsciqgUA7r6rAHHaXN1R0z-BhdrQogdzP3xc9-PmOQTQ&vjfrom=vjs&astse=fa77d0ba3f6e752d&assa=4434",
            "pay": "$105,930 - $158,890 a year",
            "job_type": null,
            "benefits": [
                "Health insurance"
            ],
            "description": "Job Description\n\nIntel is a company of bold and curious inventors and problem solvers who create some of the most astounding technology advancements and experiences in the world.\n\nWith a legacy of relentless innovation and a commitment to bring smart, connected devices to every person on Earth, our diverse and brilliant teams are continually searching for tomorrow's technology and revel in the challenge that changing the world for the better brings. We work every single day to design and manufacture silicon products that empower peoples digital lives.\n\nDo you love to solve technical challenges that no one has solved yet? Do you enjoy working with cross functional teams to deliver IP solutions for products that impact customers lives? If so, Come join us to do something wonderful.\n\nWe are looking for world class data engineers to help us build the future of technology.\n\nIn addition to the qualifications listed below, the ideal candidate will also demonstrate the following traits:\nExcellent written and communication skills\nWorks well independently and develops quick engineering solutions for complex problems\nSkilled at interfacing with engineers and managers by providing schedule updates\nHigh problem-solving skills and good tolerance for ambiguity\nKnows how to prioritize tasks independently\nNatural focus on quality, discipline, and accurate results for engineering customers\nContributes and works well in a multi-site team setting\nBy applying to this prescreen posting, you are expressing interest in other job opportunities with Intel.\nOpportunities that you will be considered for:\nSoftware Engineer\nData Scientist\nCloud Software Development Engineer\nSoftware Data Engineer\nAI Software Development Engineer\nAI Algorithm Engineer\nSenior Systems Data Analyst\nMachine Learning Engineer\n\nQualifications\n\nEducation:\nThe candidate must possess a Bachelors OR Masters degree in Data Science with 3+ months of educational or industry experience.\n\nDiscipline in: Data Science\n\nAdditional Information:\nLife at Intel: https://jobs.intel.com/en/life-at-intel\n\nFor information on Intel's immigration sponsorship guidelines, please see:\nhttps://www.intel.com/content/www/us/en/jobs/hiring.html\n\nInside this Business Group\n\nIntel's Human Resources group is responsible for hiring, developing and retaining the best and brightest employees while continuing to strengthen the company's culture and values. Intel Human Resources provides first-rate, cost-effective services and support to employees worldwide and is dedicated to advancing Intel's business goals.\nOther Locations\n\nUS, NM, Albuquerque; US, OR, Hillsboro; US, TX, Austin; US, CA, Folsom; US, CA, Santa Clara; US, GA, Atlanta\nPosting Statement\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.\nBenefits\n\nWe offer a total compensation package that ranks among the best in the industry. It consists of competitive pay, stock, bonuses, as well as, benefit programs which include health, retirement, and vacation. Find more information about all of our Amazing Benefits here: https://jobs.intel.com/en/benefits\n\nAnnual Salary Range for jobs which could be performed in US, California: $105,930.00-$158,890.00\nSalary range dependent on a number of factors including location and experience\n\nWorking Model\n\nThis role will be eligible for our hybrid work model which allows employees to split their time between working on-site at their assigned Intel site and off-site. In certain circumstances the work model may change to accommodate business needs.\n\nJobType\nHybrid"
        },
        {
            "posted_at": "Just posted",
            "applications": null,
            "title": "Data Analyst",
            "company_name": "Clario",
            "company_rating": "3.8",
            "company_reviews": "5",
            "location": "Remote",
            "location_type": null,
            "apply_link": "https://www.indeed.com/applystart?jk=e90a1cb0b8b2d848&from=vj&pos=bottom&mvj=0&jobsearchTk=1he93rqf2k7st800&spon=0&xfps=b11ff5e3-64c4-46e2-be04-8c8d93c301e0&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXjOKe48WsaQxjL6gvMz7gyyl8EZNoFLzyHkpvcd7-Y9bg&vjfrom=vjs&astse=31faf4396118bea4&assa=7648",
            "pay": null,
            "job_type": null,
            "benefits": null,
            "description": "Data analyst responsibilities include conducting full lifecycle analysis to include requirements, activities, and design. Data analyst will develop analysis and reporting capabilities. Turn data into information, information into insight and insight into business decisions.\nESSENTIAL DUTIES AND RESPONSIBILITIES:\nUsing statistical tools to identify, analyze, and interpret patterns and trends in complex data sets could be helpful for the diagnosis and prediction.\nAssigning numerical value to essential business functions so that business performance can be assessed and compared over periods of time.\nAnalyzing local, national, and global trends that impact both the organization and the industry.\nPreparing reports for the management stating trends, patterns, and predictions using relevant data\nPreparing final analysis reports for the stakeholders to understand the data-analysis steps, enabling them to take important decisions based on various facts and trends.\nIn this role, you will combine business understanding, data handling, and data visualization to drive smarter, more data-driven business decisions.\nAcquire data from primary or secondary data sources and maintain databases/data systems.\nIdentify, analyze, and interpret trends or patterns in complex data sets.\nAnalyze internal trends and translate data into consumable insights for varying audiences.\nCommunicate the results of analysis with business partners to impact strategy and action.\nEnsure data integrity and accuracy through focus and attention to detail.\nQualifications:\nExperience:\nProven working experience as a Data Analyst or Business Data Analyst.\nTechnical expertise regarding data models, database design development, data mining and segmentation techniques.\nStrong knowledge of and experience with reporting packages (Business Objects etc.), databases (SQL etc.), programming (XML, JavaScript, or ETL frameworks).\nKnowledge of statistics and experience using statistical packages for analyzing datasets (Excel, SPSS, SAS etc.).\nStrong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy.\nAdept at queries, report writing and presenting findings.\nEducation:\nBS in Mathematics, Economics, Computer Science, Information Management or Statistics.\nEEO Statement\nClario is an equal opportunity employer. Clario evaluates qualified applicants without regard to race, color, religion, gender, national origin, age, sexual orientation, gender identity or expression, protected veteran status, disability/handicap status, or any other legally protected characteristic.\nThe Department Head has the discretion to hire personnel with a combination of experience and education, which may vary from the above listed qualifications.\nThe duties and responsibilities listed in this job description represent the major responsibilities of the position. Other duties and responsibilities may be assigned, as required. Clario reserves the right to amend or change this job description to meet the needs of Clario. This job description and any attachments do not constitute or represent a contract.\nCourageously Curious\n\nOur appetite to blend the best of domain expertise, technology and human understanding knows no bounds. We’re relentless in pursuing the information, insights and inspiration that means we can continuously improve clinical trial site support services and technology solutions.\n\nBehaviors:\n\nWe learn; embracing change, questioning how we work, finding a better way. And if it doesn't go to plan, we don't blame each other; instead, we own it and grow together\nWe partner' with each other, with customers, patients and sites, working with them to understand their goals and then deliver the best solutions, Deliver Exceptional\n\nWe step forward because responsibility powers us; we don’t leave others to do what we can do ourselves. We take charge of events, delivering exceptional work for our customers, patients and each other.\n\nBehaviors:\n\nWe prioritize; focusing on what matters, never compromising on quality.\nWe commit; delivering what we say we will, working with energy and intent, sharing what we learn with each other., People first, always\n\nWe think of others before we think of ourselves. We have a deep understanding of our customers, and deep empathy for patients—and each other. We’re united by our purpose—it’s why we go above and beyond to support each other, emphatically.\n\nBehaviors:\n\nWe do the right thing; for our customers, patients, sites and each other. And We're passionate about it.\nWe lift each other up; respectful of different views, we listen are inclusive, and support each other to succeed."
        },
        {
            "posted_at": "30+ days ago",
            "applications": null,
            "title": "Data Analytics Specialists",
            "company_name": "AccelPad",
            "company_rating": null,
            "company_reviews": null,
            "location": "Remote",
            "location_type": null,
            "apply_link": "https://www.indeed.com/applystart?jk=4d8a84c74bc9a21c&from=vj&pos=bottom&mvj=0&jobsearchTk=1he93rqf2k7st800&spon=0&xfps=45e80707-e16c-4711-aa1a-1349b438914b&sjdu=sl518MN4d7lkJJVaJZfAGqjWxnj9pFvwe21KtnqizoA&vjfrom=vjs&astse=691eaf5041dc46b7&assa=544",
            "pay": null,
            "job_type": null,
            "benefits": null,
            "description": "We are currently looking for multiple outstanding data analytics specialists. Data visualization, data engineering, and support integration and automation projects using Python/java/PowerBI and REST APIs. Email your resume today to hr@accelpad.com with position ID in the subject."
        },
        {
            "posted_at": "2 days ago",
            "applications": null,
            "title": "Associate Data Science Analyst - Remote",
            "company_name": "Mayo Clinic",
            "company_rating": "3.9",
            "company_reviews": "3,044",
            "location": "Jacksonville, FL 32224",
            "location_type": "Remote",
            "apply_link": "https://www.indeed.com/applystart?jk=2432c13cb7d71964&from=vj&pos=bottom&mvj=0&jobsearchTk=1he93rqf2k7st800&spon=0&xfps=8c73bf16-0ec8-4f27-9d1d-9aa5fcda0727&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXgNsPUDvbPW0dIjtJer_1lxIv02HSGSZoWequxOEmCHqw&vjfrom=vjs&astse=80fd4631c2700c00&assa=3822",
            "pay": "$73,029 - $109,450 a year",
            "job_type": null,
            "benefits": [
                "Continuing education credits",
                "Opportunities for advancement"
            ],
            "description": "Why Mayo Clinic\n\nMayo Clinic is top-ranked in more specialties than any other care provider according to U.S. News & World Report. As we work together to put the needs of the patient first, we are also dedicated to our employees, investing in competitive compensation and comprehensive benefit plans – to take care of you and your family, now and in the future. And with continuing education and advancement opportunities at every turn, you can build a long, successful career with Mayo Clinic. You’ll thrive in an environment that supports innovation, is committed to ending racism and supporting diversity, equity and inclusion, and provides the resources you need to succeed.\n\n\nResponsibilities\nThis position utilizes data analysis, data mining, pattern analysis, data visualization, reporting, and data management skills. Supports projects under close supervision of senior data analysts or data scientists. Types of work include descriptive analytics, data query scripting, data analysis, data engineering, visualizations, and forecasting. Other responsibilities: Provides data insights for business problems that can be approached with analytics techniques to collect, explore, and extract insights from structured and unstructured data. Has basic expertise in the data science methods used to analyze data, and knowledge of data types, topics, and scientific challenges and approaches. Executes analytical procedures in the framework of a specific project work request. Modifies scripts or software applications to support data management, data extraction and data analysis as required. Contributes to the interpretation of data analysis and to writing reports. May help customers understand the data set and provide training and suggestions for improvement on the data request. Leverages communication and interpersonal skills and works with subject matter experts Presents findings in easy to understand terms for the business or clinical practice.\n\nQualifications\nBachelor's degree in a domain-relevant field such as engineering, mathematics, computer science, statistics, physics, data science, health science, or another analytical/quantitative field. Ability to develop predictive models to address various business problems through leveraging advanced statistical modeling, machine learning, or data mining techniques, is preferred. Demonstrated application of several problem-solving methodologies, planning techniques, continuous improvement methods, and analytical tools and methodologies (e.g. machine learning, statistical packages, modeling, etc.) is required. Incumbent must stay current on healthcare trends and enterprise changes. Interpersonal skills and time management skills are required. Requires strong analytical skills and a commitment to customer service.\n\nExemption Status\n\nExempt\n\nCompensation Detail\n\n$73,028.80 - $109,449.60 / year\n\nBenefits Eligible\n\nYes\n\nSchedule\n\nFull Time\n\nHours/Pay Period\n\n80\n\nSchedule Details\n\nMonday - Friday; business hours\n\nWeekend Schedule\n\nN/A\n\nInternational Assignment\n\nNo\n\nSite Description\nJust as our reputation has spread beyond our Minnesota roots, so have our locations. Today, our employees are located at our three major campuses in Phoenix/Scottsdale, Arizona, Jacksonville, Florida, Rochester, Minnesota, and at Mayo Clinic Health System campuses throughout Midwestern communities, and at our international locations. Each Mayo Clinic location is a special place where our employees thrive in both their work and personal lives. Learn more about what each unique Mayo Clinic campus has to offer, and where your best fit is.\n\nAffirmative Action and Equal Opportunity Employer\n\nAs an Affirmative Action and Equal Opportunity Employer Mayo Clinic is committed to creating an inclusive environment that values the diversity of its employees and does not discriminate against any employee or candidate. Women, minorities, veterans, people from the LGBTQ communities and people with disabilities are strongly encouraged to apply to join our teams. Reasonable accommodations to access job openings or to apply for a job are available.\n\n\nRecruiter\n\nChelsea Crosby"
        },
        {
            "posted_at": "30+ days ago",
            "applications": null,
            "title": "Deutsche Bank Graduate Programme - Technology, Data and Innovation (TDI) – New York 2024",
            "company_name": "Deutsche Bank",
            "company_rating": "3.8",
            "company_reviews": "3,300",
            "location": "New York, NY",
            "location_type": null,
            "apply_link": "https://www.indeed.com/applystart?jk=c43bd2e9b6aa05f3&from=vj&pos=bottom&mvj=0&jobsearchTk=1he93rqf2k7st800&spon=0&xfps=ed34791c-dc8c-4c51-bec2-651de53f6481&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXi8vg3O83psoON7Kb6o1wA9ULY8luZ3vf8Ryj3D5QnPXg&vjfrom=vjs&astse=3872f0b8d9086735&assa=6780",
            "pay": null,
            "job_type": null,
            "benefits": [
                "Employee assistance program",
                "Health insurance",
                "Parental leave"
            ],
            "description": "Country:\nUnited States\nCity:\nNew York\nJob Description:\nThe Deutsche Bank Graduate Programme is a year-long comprehensive programme designed to provide you with exposure to a range of fascinating projects and ongoing professional and technical training to develop the skills you need to grow your career. You’ll feel supported by a network of peers and mentors and benefit from our global wellbeing programme.\nTechnology underpins Deutsche Bank’s entire business and is changing and shaping the way we engage, interact and transact with our stakeholders, internally and externally. Our Technology, Data and Innovation (TDI) strategy is strengthening our engineering expertise, introducing an agile delivery model, and is modernising the bank's IT infrastructure with long-term investments and taking advantage of cloud computing. We are building a team of visionary technology talent that will ensure that we thrive in this period of unprecedented change for the industry. That means hiring the right people and giving them the training, freedom and opportunity they need to do pioneering work.\nAbout the role\nOur technology teams deliver and manage engineering solutions to support the bank’s global customers. You will develop and deliver solutions to help modernise technology solutions, to reduce complexity and risk, and to drive business growth. You will be part of a creative, collaborative and innovative team, partnering with others, sharing solutions and you will have a strong desire to make an impact.\nWe offer a structured entry-level rotational programme that will equip you with the foundational knowledge and skills necessary to build a long-term career as a technology professional at Deutsche Bank.\nDepending on your rotation you will gain expertise in:\ndesigning & delivering engineering solutions for our businesses and customers\nproviding production engineering services to ensure the safety and reliability of our technology\nanalysing business data within DB to inform plans and deliveries\nenhancing our infrastructure capabilities and functions\nusing standard design patterns for strategic DB frameworks like Fabric, Autobahn, GLUE.\nWhat we look for\nWe recruit students and graduates who are intelligent and adaptable with excellent communication skills. They have degrees in many different disciplines. Even though good levels of numeracy are important for some roles, you won’t necessarily need a formal mathematical or financial background. Our comprehensive training programmes will give you all the technical knowledge you’ll need to build a career with us.\nPlease note that to apply for our 2024 Graduate Programme you must graduate between December 2023-June 2024.\n\nOur Wellbeing is our success\nFeeling healthy, engaged and well-supported, enables us to do our best work and get the most out of life outside of the office. That’s why Deutsche Bank is committed to providing benefits and programmes centred around wellbeing.\nFinancial wellbeing: A range of benefits including pension, life assurance, insurance for accident and disability, and in select locations we offer an employee share purchase plan and flexible benefit plans.\nComprehensive life and health: Medical insurance, preventative health checks, flu vaccinations and Employee Assistance Program. Mental health first aiders and company doctors available is select countries.\nParental benefits: Parental leave based on caregiver responsibility, maternity cover, phased back to work arrangements post parental leave, childcare leave and additional support offered in some countries.\nGenerous time: Annual leave, sick leave, and in select locations, wellbeing leave, family care and elder care leave.\nHybrid work model: For qualifying roles, eligible employees can work remotely based on divisional and country guidelines.\n\nHow to Apply\nPlease visit www.careers.db.com/students-graduates to apply.\nThe annualized salary for this position is $100,000. Posted Salary ranges do not include incentive compensation or any other type of renumeration.\nNext interviews for this role will take place in January 2024\nFor candidates applying for positions in the US:\nDeutsche Bank is an Equal Opportunity Employer - Veterans/Disabled and other protected categories. Click these links to view the \"EEO is the Law\" poster and \"pay transparency statement.\"\nA notice on Recruitment Scams:\nPlease note that candidates are not required to pay money as part of the recruitment or job placement process. Do not divulge personal information if you are unsure of the authenticity of a communication from someone who claims to be representing Deutsche Bank. A notice on such scams and practices has been hosted on our website on the link below:\nhttps://careers.db.com/professionals/a-notice-on-recruitment-scams\n\n#LI-EC1"
        },
        {
            "posted_at": "10 days ago",
            "applications": null,
            "title": "Data Analyst",
            "company_name": "Avenue Code",
            "company_rating": "4.2",
            "company_reviews": "17",
            "location": "United States",
            "location_type": "Remote",
            "apply_link": "https://www.indeed.com/applystart?jk=0e172c375e48bc20&from=vj&pos=bottom&mvj=0&jobsearchTk=1he93rqf2k7st800&spon=0&xfps=d9105e3f-6267-46c1-a527-841331cc4080&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXgxT_QoVTn5TsOSmRPo8sRHwsdLqiuaGy5Gw05HfKNzLw&vjfrom=vjs&astse=b2f40eed8da36329&assa=769",
            "pay": null,
            "job_type": null,
            "benefits": null,
            "description": "Sobre a empresa:\nA Avenue Code é líder em consultoria de software e focada em oferecer soluções de desenvolvimento de ponta a ponta para a transformação digital em todas as verticais de organizações de diferentes setores. Somos uma empresa privada, lucrativa e, há 15 anos, estamos em uma trajetória contínua de crescimento. Preocupamo-nos com nossos clientes, parceiros e nosso time global. Preferimos a palavra “parceiro” a “fornecedor” e nosso investimento em relacionamentos profissionais é um reflexo dessa filosofia. Temos orgulho de nossa perspicácia técnica, de nossa capacidade colaborativa na resolução de problemas e do profissionalismo de nosso time #OneAvenueCode.\nMais de 3 anos trabalhando em estratégias de diversidade e inclusão, a Avenue Code acredita que reconhecer a diferença e promover um lugar seguro, oportunidades de trabalho, representatividade e apoio é a melhor forma de fazer a transformação social acontecer. Todas as vagas de emprego visam promover o reconhecimento dos pilares da diversidade.\nSobre a oportunidade:\nWe are looking for a passionate, hard-working, and talented Data Analyst to join our team. You will be working with one of our biggest clients on products with a high impact on their revenue.\nResponsabilidades:\nWork with product partners to find practical solutions to our business problems based on data. This will require an ability to translate problems stated in business terms into quantitative approaches leading to projects starting small and aspiring to grow big if preliminary results are promising.\nSet up testing (A/B test or pre-post) to measure performance in the best possible way.\nAnalyze large sets of data to understand the impact of product changes on the customer journey and to traffic/revenue goals.\nDrive cohort studies and drive analyses to understand customer behavior and find opportunities for improving our product(s).\nTransform scientific/data analysis and communicate business performance in a clear and insightful way to the product teams to facilitate timely and informed decision-making.\nQualificações necessárias:\nWe know that each person has gone through different career paths that have provided further knowledge. If you don’t check all the points: go ahead! Apply anyways! Your experience is much more than a technology checklist.\nExperience as a business analyst, data scientist, or related field.\nUnderstanding of statistics, experimental design, and causal inference.\nExcellent SQL skills as well as experience with common data and statistical toolkits such as R, Python, PySpark, etc.\nExpertise with business intelligence and/or data visualization tools such as Tableau, MicroStrategy, etc.\nPrior experience in performance measurement, creatively applying regression techniques / modeling, optimization techniques, A/B testing, etc. for business applications.\nSerá um diferencial possuir:\nMore than 3 years of working on diversity and inclusion strategies, Avenue Code still believes that recognizing the difference and promoting a safe place, job opportunities, representativeness, and support is the best way to make the social transformation happen. All job openings aim to promote employment and recognition of diversity pillars.\nAvenue Code discloses salary range information in compliance with state and local pay transparency obligations. It considers a wide range of factors such as internal equity, geographic location, relevant education, qualifications, certifications, experience, skills, seniority, business or organizational needs and others. At Avenue Code it is not typical for an individual to be hired at or near the top of the range for their role and compensation decisions are dependent on the facts and circumstances of each case. A reasonable estimate of the current range for US Based Data Analyst is 110K to 200K per year.\n#Li-Remote"
        },
        {
            "posted_at": "Just posted",
            "applications": null,
            "title": "Data Specialist, Borger Refinery",
            "company_name": "Phillips 66",
            "company_rating": "3.7",
            "company_reviews": "871",
            "location": "Borger, TX 79008",
            "location_type": null,
            "apply_link": "https://www.indeed.com/applystart?jk=553d89c77c7b09de&from=vj&pos=bottom&mvj=0&jobsearchTk=1he93rqf2k7st800&spon=0&xfps=5005f3dc-e12f-44fb-890f-b2d02c9d87fe&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXjIH8xz5sT7KR9TX3JvzbVKGQFsFDP3gSdjjHZnj9ZEfg&vjfrom=vjs&astse=f96a269e6dfbe508&assa=4787",
            "pay": null,
            "job_type": null,
            "benefits": [
                "401(k)",
                "401(k) 8% Match",
                "401(k) matching",
                "Dental insurance",
                "Employee assistance program",
                "Health insurance",
                "Health savings account"
            ],
            "description": "Phillips 66 & YOU - Together we can fuel the future\n\nThe Data Specialist will assist with managing the Information Management system that ensures the Borger Refinery controlled documents are kept current and business records are maintained in accordance with the Corporate Records Management Policy and with standard business practice. Provides functional guidance to the Engineering Records workforce. Provides support for General and Doc Admin groups, Livelink, SAP/DMS, Records Management and Document Management.\n\nResponsibilities May Include:\nResponsible for document and records management quality assurance and compliance issues.\n\nManaging the lifecycle of controlled documentation and business records, and overseeing the storing, arranging, indexing, and classification of electronic and/or paper-based information.\n\nAssists with maintaining records management policies, procedures, and filing systems specific to the refinery.\n\nAssists with managing the security and permissions access to information within Livelink.\n\nAssists IT Area Lead and Digital Coordinator on system migrations, upgrades, and implementations.\n\nCreate and maintain Equipment information Folders through the MOC Process, RFIs, and SAP FLOC/Equip Request.\n\nSupport Mechanical Integrity and Reliability goals by developing and sustaining consistent required documentation for plant equipment and records management.\n\nSupport TA and Capital Projects with completion of all Functional Location and Equipment Requests, ARC RFI's and the MOC process.\n\nCreate and Maintain all Functional Locations and Equipment in SAP per the MOC Process, RFIs, PCAFs, and SAP FLOC/Equipment Requests.\n\nManage controlled documents and Legal Holds to assure that documents are kept current and business records are maintained in accordance with the Corporate Records Management Policy.\n\nManage the development of Livelink workflows to improve business work processes.\n\nProvide guidance to Employees and Contractors on populating attributes, developing folder and file structure within Livelink.\n\nRequired Qualifications:\nLegally authorized to work in the job posting country\n\nHigh school diploma or GED equivalent\n\n18 years of age or older\n\nPrevious work experience in a refinery environment\n\nIntermediate level of proficiency in Livelink\n\nIntermediate level of proficiency in SAP\n\nIntermediate level of proficiency in Microsoft Office\n\nExcellent inter-personal and strong organizational skills\n\nPreferred Qualifications:\n1 or more years of experience in records management such as record storage, filing and retrieval\n\nStrong and effective communication skills (written and verbal) with all levels of the organization\n\nAbility to plan and coordinate document and records management activities and interface across all plant functions\n\nAbility to plan program resource needs to meet objectives\n\nAbility to interpret regulatory guidance\n\nAbility to organize large amounts of data efficiently\n\nAbility to troubleshoot problems, collect data, establish facts, and draw conclusions\n\nAbility to get work done through others to develop win/win solutions\n\nAbility to provide concise, specific feedback and receive feedback without umbrage\n\nStrong team skills\n\nThe Borger Refinery is located in Borger, Texas, in the Texas Panhandle, approximately 50 miles north of Amarillo, Texas. Refinery facilities include crude distilling, naphtha reforming, fluid catalytic cracking, alkylation, hydrodesulfurization and delayed coking units. The refinery processes primarily medium sour crude oil produced locally, and heavy sour crude oil produced in Canada, all of which are delivered by pipeline. Borger produces a high percentage of transportation fuels, as well as petroleum coke, NGLs and solvents. Refined products are distributed to customers via pipelines from the refinery to West Texas, New Mexico, Colorado and the Midcontinent region.\n\nTotal Rewards\n\nAt Phillips 66, providing access to high quality programs and care for you and your family is important to us. Maintaining a culture of well-being — physical, emotional, social, and financial — is essential for a high-performing organization. When we are at our best, we are poised to deliver exceptional results — personally and professionally. Benefits for certain eligible, full-time employees include:\n\nAnnual Variable Cash Incentive Program (VCIP) bonus\n\n8% 401k company match\n\nCash Balance Account pension\n\nMedical, Dental, and Vision benefits with an annual company contribution to a Health Savings Account for employees on HDHP\n\nTotal well-being programs and incentives, including Employee Assistance Plan, well-being reimbursement, and backup family care services\n\nLearn more about Phillips 66 Total Rewards at hr.phillips66.com/.\n\nPhillips 66 has more than 140 years of experience in providing the energy that enables people to dream bigger and go farther, faster. We are committed to improving lives, and that is our promise to our employees and our communities. We are sustained by the backgrounds and experiences of our diverse teams, which reflect who we are, the environment we create and how we work together. Our company is built on values of safety, honor and commitment. We call our cultural mindset Our Energy in Action, which we define through four simple, intuitive behaviors: We work for the greater good, create an environment of trust, seek different perspectives and achieve excellence. Phillips 66 was recognized by Forbes as one of “America’s Best Employers” in 2021.\n\nLearn more about Phillips 66 and how we are working to meet the world's energy needs today and tomorrow by visiting phillips66.com.\n\nTo be considered\n\nIn order to be considered for this position you must complete the entire application process, which includes answering all prescreening questions and providing your eSignature on or before the requisition closing date of [[custClosingDate]] .\n\nCandidates for regular U.S. positions must be a U.S. citizen or national, or an alien admitted as permanent resident, refugee, asylee or temporary resident under 8 U.S.C. 1160(a) or 1255(a)(1). Individuals with temporary visas such as E, F-1, H-1, H-2, L, B, J, or TN or who need sponsorship for work authorization now or in the future, are not eligible for hire.\n\nPhillips 66 is an EEO and Affirmative Action Employer of Women/Minorities/Veterans/Individuals with Disabilities\n\nRequisition ID: 58433\n\nLocation: Texas - Borger\n\nJob Field: Administrative Professionals\n\nDivision : Borger Refinery\n\nTechnical Req : No"
        },
        {
            "posted_at": "Just posted",
            "applications": null,
            "title": "Contract & Data Entry Specialist",
            "company_name": "GFL Environmental Inc.",
            "company_rating": "2.5",
            "company_reviews": "824",
            "location": "Raleigh, NC",
            "location_type": null,
            "apply_link": "https://www.indeed.com/applystart?jk=9b67bdaa09ebf489&from=vj&pos=bottom&mvj=0&jobsearchTk=1he93rqf2k7st800&spon=0&xfps=3d5266da-28d6-4371-9a9e-8035c0ce5ea9&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXh25Y_eGN1Vcjmz3OwL-gBxnUUKYs5yKqp3Fg7KgmoxhA&vjfrom=vjs&astse=f3809df3000d6cee&assa=9349",
            "pay": null,
            "job_type": null,
            "benefits": null,
            "description": "The Contract & Data Entry Clerk will enter and verify all temporary and permanent commercial contracts and service level transactional changes for the branches. Cancel all permanent commercial customers, enter information related to seasonal commercial customers, and adhere to the processes of transmitting the information to and from the branches. All work supervised and reviewed by Specialist II and Supervisor. Will support CDE Specialist II, Corporate Customer Specialist and CDE Supervisor.\n\nKey Responsibilities:\nDaily entry of all commercial contracts and service level changes, both temporary and permanent.\nDaily cancellation of permanent accounts.\nRequires verification of orders previously entered by other CDE Specialists, set by published guidelines.\nMust meet and maintain department productivity goals set by published guidelines.\nInitiate and monitor customer delivery work orders.\nInitiate and monitor customer return to stock work orders.\nEnter and update customer contract terms.\nExempt customers with contractual limitations for price increases from traditional price increase methods.\nInitiate correspondence to appropriate manager to implement contractual price. increases when applicable; adhere to billing department policy as it relates to price increase processing.\nInitiate correspondence to appropriate manger to process reinstatement of service for seasonal customers.\nSupport and train branch personnel on processes used to transmit necessary data to and from the centralized data entry team.\nIndex imaged data to correct customer’s Tower account and ensure imaged database is accurate and well maintained.\nConform in all respects with applicable federal, state/provincial and local laws, regulations, ordinances and other orders.\nComply with all company policies, procedures and directives from supervisors.\nPerform other duties and responsibilities as required or requested by management.\nMust be able to work overtime on an as- needed basis.\nMust provide front desk coverage during breaks and vacations\n\nRequirements:\nHigh School Diploma or GED required.\nOne year of related experience and/or training.\nExcellent ten-key and data entry skills required.\nMust have working knowledge of Microsoft Office, Excel, Word and Outlook.\n\nKnowledge, Skills and Abilities:\nMust be detailed oriented.\nAbility to communicate effectively with internal and external customers.\nTOWER knowledge a plus.\nKnowledge of the waste industry preferred.\n\nCareer Advancement\nCDE Specialist II\nCustomer Service Specialist\nCDE Supervisor\n\nWe thank you for your interest. Only those selected for an interview will be contacted.\nGFL Environmental is an equal opportunity employer and encourages women, Aboriginal people, persons with disabilities and members of visible minorities to apply. We seek to hire individuals with diverse characteristics, backgrounds and perspectives. We strongly believe that world-class talent makes no distinctions based on gender, ethnic or national origin, sexual identity and orientation, age, religion or disability, but enriches itself through these differences. GFL will provide accommodations to job applicants with disabilities throughout the recruitment process. If you require an accommodation, please notify us and we will work with you to meet your needs."
        },
        {
            "posted_at": "8 days ago",
            "applications": null,
            "title": "Data Analyst",
            "company_name": "Disney",
            "company_rating": "4.1",
            "company_reviews": "4,480",
            "location": "Santa Monica, CA",
            "location_type": null,
            "apply_link": "https://www.indeed.com/applystart?jk=29751803e3478182&from=vj&pos=bottom&mvj=0&jobsearchTk=1he93rqf2k7st800&spon=0&xfps=4df5596c-d636-4f9c-ba97-102782ad4cab&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXhs3BO_TtOJ51RFsMQ8NQLzMIfcMu539kP3i1FMxIq2rA&vjfrom=vjs&astse=cdc59ad208c4cf24&assa=2891",
            "pay": null,
            "job_type": null,
            "benefits": [
                "Health insurance"
            ],
            "description": "Data Analyst\nApply Later\nJob ID\n10066290\nLocation\nSanta Monica, California, United States\nBusiness\nDisney Direct to Consumer\nDate posted\nOct. 24, 2023\nJob Summary:\nThe Walt Disney Company Direct to Consumer’s Data and Analytics organization is seeking a Data Analyst who will be an exceptional addition to our Live and Sports Analytics, Content team. As Data Analyst, you will join our content team that applies analytical rigor to develop deal renewal strategies, content performance analyses and user behavior patterns.\nThe right candidate for this role has exceptional analytical skills, thrives in a fast-paced environment, loves problem solving, is a strong communicator, and is passionate about streaming/TV/movie content. If you are someone who gains personal satisfaction from utilizing data to drive business decisions and you’re eager to learn, then this is a great role for you.\nWhat you’ll do\nApply technical and data analysis techniques on high-dimensional data to inform strategic business decisions.\nAnalyze content performance and user behavior (e.g., content seasonality, viewing behaviors) to identify unmet customer needs and untapped content opportunities.\nBuild end-to-end scalable, dynamic and automated Tableau dashboards used by our direct stakeholders.\nWork closely with content partnership and brand marketing team to understand business gaps and conduct detailed and insightful analyses and report on post-mortem performance reviews.\nProactively perform data exploration and analytical deep dives to discover insights or future opportunities.\nProvide ad-hoc analysis support for stakeholders to help move the business forward.\nEffectively communicate actionable results through compelling data storytelling across the organization.\nWhat to bring\nBachelor’s degree in Mathematics, Statistics, Computer Science or equivalent knowledge.\n3+ years Data Analytics experience with strong technical skills in manipulating large data sets with complex SQL and visualization tools (e.g., Tableau).\nExperience taking vague requirements and crystallizing them into valuable tools, metrics, or analysis.\nDemonstrated ability in working independently and experience in managing stakeholder asks, expectations and managing relationships across various teams.\nOutstanding data storytelling skills through verbal, written, and visual communication.\nExperience in streaming is a plus.\n\nThe hiring range for this position in Santa Monica is $93,400 - $125,200 per year. The base pay actually offered will take into account internal equity and also may vary depending on the candidate’s geographic region, job-related knowledge, skills, and experience among other factors. A bonus and/or long-term incentive units may be provided as part of the compensation package, in addition to the full range of medical, financial, and/or other benefits, dependent on the level and position offered."
        },
        {
            "posted_at": "30+ days ago",
            "applications": null,
            "title": "Junior Data Analyst",
            "company_name": null,
            "company_rating": null,
            "company_reviews": null,
            "location": "Chicago, IL 60603",
            "location_type": null,
            "apply_link": "https://www.indeed.com/applystart?jk=f44877719f3cbe3a&from=vj&pos=bottom&mvj=0&jobsearchTk=1he93rqf2k7st800&spon=0&xfps=b014fbeb-ffc1-4c16-8c92-1e4a3e95cdb8&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXgK7iLNhLZBqY5zFKhao-ph5Z_dA0xndw9ylAW4Hz2CAQ&vjfrom=vjs&astse=00a10a4276af7ad2&assa=5497",
            "pay": null,
            "job_type": null,
            "benefits": [
                "401(k)",
                "Dental insurance",
                "Health insurance",
                "Paid time off",
                "Prescription drug insurance",
                "Vision insurance"
            ],
            "description": "Junior Data Analyst | Chicago - Hybrid\nAbout Us!\nKooth is a fast-growing organization with a social purpose. After 20 years of successful services in the UK, we are rapidly expanding in the United States!\n\nOUR MISSION: To provide welcoming and effective digital mental health support to students proactively.\nUsing the collective insight from nearly 1 million hours of professional intervention, we guide students to three areas of evidenced-based support: self-guided, community/peer interactions, and chat-based counseling provided by licensed Counselors. These areas of assistance are designed to match each individual student’s current needs, wants and goals as well as identify and refer to a higher level of care when needed.\n\nWe’re seeking a talented and motivated Junior Data Analyst to join our team, the ideal candidate will have the ability to enable data driven decisions, clinical excellence and commercial success throughout Kooth, by the provision of data and insights via dashboards, reporting and pieces of analysis, using data manipulation and visualization tools to access and optimize Kooth's data model.\n\nIf you are seeking a fun, professional culture, in a fast-growing company, look no further - Apply today!\n\nPrimary Job Responsibilities:\n\nSupport evidence-based Product Development through analysis of service user behavior\nEnable commercial success through delivery of insights and narrative aligned to strategic communication\nSupport research team in the delivery of Clinical and Economic Evaluations\nProvide data and insights to enable optimization of clinical and service delivery processes\nOptimize dashboards with new data points and improved functionality\nWork closely with function leads and Insights Team colleagues, in translating insights requirements into work plans\nCommunicate progress, issues and blockers on tasks and projects\n\nAt least 1 year experience data analytics\nA degree in a relevant subject such as Mathematics, Data Science, Computer Science, Information Management or Statistics\n\nCompensation: $ 75,000- $ 85,000 based on experience.\n\nHere are some of the exciting benefits you will receive as a team member at Kooth:\n\nExcellent Medical, Dental and Vision benefits\nPrescription drug coverage\nGenerous paid time off\n8 paid holidays plus two, half-day holidays (Christmas Eve and New Years Eve)\n401(k) retirement plan\n\nKooth provides equal employment opportunities to all people without regard to race, color, national origin, ancestry, citizenship, age, religion, gender, sex, sexual orientation, gender identity, gender expression, marital status, pregnancy, physical or mental disability, protected medical condition, genetic information, military service, veteran status, or any other status or characteristic protected by law."
        },
        {
            "posted_at": "Just posted",
            "applications": null,
            "title": "Data Visualization Specialist",
            "company_name": "Dept of State Health Services",
            "company_rating": "3.3",
            "company_reviews": "2,534",
            "location": "1100 West 49th Street, Austin, TX 78756",
            "location_type": null,
            "apply_link": "https://www.indeed.com/applystart?jk=8818637178a2dc62&from=vj&pos=bottom&mvj=0&jobsearchTk=1he93rqf2k7st800&spon=0&xfps=5021672a-dc69-48b3-89de-736c80017a18&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXjZKff1VLYoZ49ApQfzQMpkMIfcMu539kP3i1FMxIq2rA&vjfrom=vjs&astse=108f24e8c714684a&assa=1279",
            "pay": "$4,273 - $5,591 a month",
            "job_type": null,
            "benefits": null,
            "description": "***This position is primarily telework with an in-office once a month***.\n\nThe Data Visualization Specialist (Creative Media Designer III) supports the efforts of the Data Dissemination Team within the Center for Health Statistics (CHS), Agency Analytics Unit (AAU) This position works with other team members to produce creative, engaging, impactful, and interactive data visualization graphics and products, translating data into meaningful information and spurring new insights for decision makers. This position coordinates with agency staff to design and disseminate DSHS and other available opioid-related data through graphic design and data visualization software. This position may occasionally respond to data and other special requests, including those from DSHS and HHSC partners. Initiative and creativity are important qualities in this position, as well as excellent communication and advanced technical skills. Must work well with a variety of stakeholders. Works under minimal supervision, with extensive latitude for the use of initiative and independent judgement.\n\n\nEssential Job Functions:\nAttends work on a regular and predictable schedule in accordance with agency leave policy and performs other duties as assigned.\n\nThis position performs advanced (senior-level) graphic design and data visualization, working independently and with minimal supervision within the Data Dissemination Team. Essential job functions are as follows:\n\nEJF 1 40%: Plans, designs, develops, and implements a variety of existing and new data visualization activities and projects related to opioid data. Translates technical public health and surveillance information into plain language and apply data visualization and graphic design theories and best practices into the design of interactive dashboards, reports, and other data visualization solutions. Functions as a consultant across Texas Health and Human Services programs responding to the opioid epidemic in best practices in data communication and visualization materials. Advises agency staff regarding data visualization and graphic design developments and trends.\n\nEJF 2 35%: Serves as a member of the Data Dissemination Team within CHS. Participates in overall team goals and activities and provides technical assistance to team members. Works with subject matter experts to understand nuances of diverse datasets and incorporates this knowledge into the graphic design of data visualizations related to opioid data. Assists the Data Dissemination Team in providing direction and guidance on the availability, analysis, and interpretation of socioeconomic, demographic and public health data from a wide variety of sources related to the opioid epidemic.\n\nEJF 3 20%: Responds to special opioid requests, particularly requests from DSHS and HHSC partners. Prepares professional quality reports, presentations, and interactive dashboards that incorporate engaging and appropriate visualization of data, to include graphics, tables, and maps. Coordinates with DSHS Communications and leadership to plan, create, and execute visualization efforts on agency websites to improve data dissemination. Serves as a liaison with internal and external partners to produce special request opioid data products.\n\nEJF 4 5%: Performs other duties as assigned, including but not limited to actively participating and/or serving in a supporting role to meet the agency’s obligations for disaster response and/or recovery or Continuity of Operations activation. Such participation may require an alternate shift pattern assignment and/or location.\n\n\nKnowledge Skills Abilities:\nKnowledge Skills Abilities:\nKnowledge of graphic and multimedia design\nKnowledge of data visualization theories and best practices\nKnowledge of accessibility requirements and best practices related to data display\nKnowledge of common health status, socioeconomic, and demographic measures used in public health\nKnowledge of programming logic and scripting\nKnowledge of basic database query language\nKnowledge of publishing industry standards and operations\n\nSkill in the use of graphic design software and multimedia packages, especially Adobe Creative products\nSkill in using data visualization software, especially Tableau\nSkill in using Internet publishing/graphics presentation software\nSkill in graphical presentation of data including charts, tables, and maps\nSkill in both verbal and written communications\n\nAbility to plan and implement complex design projects.\nAbility to communicate effectively with data owners and diverse audiences.\nAbility to maintain effective working relationships.\nAbility to manage and manipulate data, using Excel or other appropriate software.\nAbility to organize and prioritize work and meet deadlines.\nAbility to exercise independent judgment and show initiative.\n\nRegistration or Licensure Requirements:\n\n\nInitial Selection Criteria:\nExperience developing in data visualization tools such as Tableau, Microsoft Power BI, or similar programs used for large data sets.\n\nExperience in statistical or quantitative analysis R, Python, SAS, SQL, STATA, or others statistical software or query languages.\n\nExperience working with confidential data and/or protected health information.\n\n\nAdditional Information:\nApplicants selected for an interview will be required to provide a of prior data visualization work product before the interview and be prepared to discuss it during the interview.\n\nThere will be a short skills test after interview.\n\nMOS Code:\n465 MC 165X PA INF 4511 4591 4503 3NOX6 35PX\n\nTop 10 Tips for Success when Applying to Jobs at HHSC and DSHS\n\n\nHHS agencies use E-Verify. You must bring your I-9 documentation with you on your first day of work.\n\nIn compliance with the Americans with Disabilities Act (ADA), HHS agencies will provide reasonable accommodation during the hiring and selection process for qualified individuals with a disability. If you need assistance completing the on-line application, contact the HHS Employee Service Center at 1-888-894-4747. If you are contacted for an interview and need accommodation to participate in the interview process, please notify the person scheduling the interview."
        },
        {
            "posted_at": "Just posted",
            "applications": null,
            "title": "Junior Data Analyst",
            "company_name": "Ironhack",
            "company_rating": "4.5",
            "company_reviews": "14",
            "location": "Miami, FL",
            "location_type": "Hybrid remote",
            "apply_link": "https://www.indeed.com/applystart?jk=a9909e9acd6182a9&from=vj&pos=bottom&mvj=0&jobsearchTk=1he93rqf2k7st800&spon=0&xfps=6b504d6d-e0a8-405c-b654-c0bd205dc18e&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXgZXccBtI9kd8plug8r-CFtnUUKYs5yKqp3Fg7KgmoxhA&vjfrom=vjs&astse=7f421af967a4585d&assa=4134",
            "pay": null,
            "job_type": null,
            "benefits": [
                "Dental insurance",
                "Health insurance",
                "Paid training",
                "Vision insurance"
            ],
            "description": "Ironhack’s Technology Apprenticeship is an opportunity for STEM college graduates to start their careers in tech. We know it can feel like college didn’t prepare you for the real world. That’s why new hires will receive 9 weeks of technical training, 1 year of an accelerated learning program, career mentorship, and join the 10,000+ Ironhack Alumni all over the world.\nThose who are selected will be given a stipend to attend 9 weeks of hands-on technical training led by Ironhack's award-winning teachers and programs. The curriculum is designed to train you to become a Data Analyst, learning Python, SQL, machine learning, data visualization and data engineering.\nAfter your paid training, you’ll be hired by IronHack and deployed to work as a Data Analyst at an innovative Miami-based startup to grow your career. Without a doubt this program will fast track your career trajectory for the digital transformation.\n\nThe upcoming training launches on November 27th so we will be reviewing resumes ASAP!\n\nJob Responsibilities\nDevelop and maintain LM based recommendation models to improve user engagement and satisfaction.\nEvaluate and optimize the performance of recommendation models.\nConduct product analytics to measure the lifetime value (LTV) and customer acquisition cost (CAC) of products.\nTrack and analyze key performance indicators (KPIs) such as user engagement, retention, and conversion rates.\nDevelop and maintain product related reports to track and analyze key metrics.\nCreate data visualizations to communicate insights to stakeholders.\nDesign, implement, and analyze A/B tests to measure the impact of changes to products and features, and make recommendations for improvement.\nDevelop and maintain recommendation engines to personalize the user experienc by analyzing user behavior and preferences to identify patterns and trends.\nWork closely with other members of the data team to collect, clean, and prepare data for analysis.\nUse a variety of data analysis tools and techniques to extract insights from data.\nCommunicate findings and recommendations to stakeholders in a clear and concise manner.\nStay up-to-date on the latest trends and developments in data analytics.\nWhat you will learn as a future Data Analyst:\nConduct exploratory data analysis; use statistics to understand the nature of data.\nApply probabilistic thinking to your analysis using intermediate-level statistics: descriptive stats, inferential stats, probability distributions, etc.\nWrite simple to complex queries in SQL to extract information from databases in order to manipulate data: SQL clauses, joins, subqueries, stored procedures, functions.\nManage end-to-end ETL (extract-transform-load) Pipeline: APIs; WebScrapping.\nUse storytelling to and data visualization to increase engagement, understanding, and impact of your presentations.\nUse Tableau as a business intelligence tool: build reports, stories, and dashboards.\nUse Python coding for processing data: Regular expressions, functional programming, Lambda, map, reduce, filter, error handling, OOP.\nUse Pandas, Seaborn, Matplotlib, Scikit Learn, and other popular libraries to build your analysis with Python.\nBuild different machine learning models (supervised and unsupervised) to make predictions, compare different models, and choose the best performing model.\nWhat are we looking for?\nBachelors or Masters in IT, STEM or Data Analytics.\nMust have a go-getter attitude and open to operating in a fast-past environment.\nHave a work permit to work in the United States: IronHack cannot provide sponsorship for the US.\nLive near South Florida because the role is based out of South Florida.\nPerks\n1 year of accelerated mentorship and tech training.\nThe job is remote but you can come to the office if you feel like it.\nHealth insurance/Dental insurance/Vision Insurance.\nCompetitive Salary with milestone raises every 6 months.\nFree bootcamp valued at $13,000.\nTons of amazing events with our students and community of instructors.\nGlobal alumni network of 10,000+ IronHack grads.\n\nDepartment\nB2B\nLocations\nMiami\nRemote status\nHybrid Remote\nEmployment type\nFull-time"
        },
        {
            "posted_at": "Just posted",
            "applications": null,
            "title": "Data Engineer II",
            "company_name": "Cincinnati Children's Hospital",
            "company_rating": "3.9",
            "company_reviews": "951",
            "location": "Cincinnati, OH 45219",
            "location_type": null,
            "apply_link": "https://www.indeed.com/applystart?jk=801f7870e0ffbf24&from=vj&pos=bottom&mvj=0&jobsearchTk=1he93rqf2k7st800&spon=0&xfps=9b7ac5d6-8773-4845-8b38-ae089786d194&sjdu=YmZE5d5THV8u75cuc0H6Y26AwfY51UOGmh3Z9h4OvXgj5jtofHr2P4akIRUEHaBXIv02HSGSZoWequxOEmCHqw&vjfrom=vjs&astse=9a88c38a314fceb4&assa=8035",
            "pay": null,
            "job_type": null,
            "benefits": null,
            "description": "Description\n\nExpected Starting Salary Range: 41.10 - 52.27\n\nSUBFUNCTION DEFINITION:\n\nAre you a skilled Data Engineer who is eager to make an immediate impact by advancing our already well-established research within the leading Children's Hospital in the country? Due to recent promotions, we are seeking a new team member who is proficient in both on-premise and cloud solutions that will enhance research initiatives and improve outcomes for children.\n\nREPRESENTATIVE RESPONSIBILITIES\n\nWhat you'll Do:\n\nAs a Data Engineer you will be responsible for collaborating with stakeholders to design and implement data models. Design, build and test data pipelines to populate both new and existing data models. Create engaging data visualizations based on specifications of end users.\n\nKey Responsibilities:\nDesigning Data Models for unique research leveraging standard models such as OMOP.\nBuilding data pipelines to bring together data from diverse sources to centralized data repositories.\nCreating Data Virtualizations, bringing multiple data sources together without proliferation.\nTelling stories through both static and interactive data visualizations.\nOptimizing queries for performance.\nUnderstanding data models used within the healthcare domain to provide efficient results for data requests.\nProviding technical expertise to researchers to support their projects.\n\n\n\nQualifications\n\nEDUCATION/EXPERIENCE\n\nRequired:\n\nWhat You'll Need:\nBachelor's degree in a related field.\n3+ years of applicable work experience.\n\nPreferred:\n\nWhat would we like you to have:\nExperience with cloud design with AWS and/or Azure.\nExperience with traditional ETL tools such as SSIS.\nData Visualization experience with Power BI and/or SSRS.\nKnowledge of Data Virtualization. Knowing how to use Denodo is a plus.\nExperience with Electronic Health Record data.\nStrong skill set using leading database engines such as Microsoft SQL Server and Oracle.\nSome experience using standard data analytics programming languages such as Python and R.\nExperience with C#\n\nCincinnati Children's is proud to be an Equal Opportunity Employer that values and treasures Diversity, Equity, and Inclusion. We are committed to creating an environment of dignity and respect for all our employees, patients, and families (EEO/AA)."
        }
    ]
}